/*
 * ====================== leet_1300.cpp ==========================
 *                          -- tpr --
 *                                        CREATE -- 2020.06.14
 *                                        MODIFY -- 
 * ----------------------------------------------------------
 * 1300. 转变数组后最接近目标值的数组和
 */
#include "innLeet.h"

#include "ListNode.h"


namespace leet_1300 {//~



// 检测的标准，不应该是 绝对值间距，而是 中间和 是否从 小于，跨越进 大于 

// 有机会重做...






//=========================================================//
void main_(){

    //std::vector<int> v { 60864,25176,27249,21296,20204 };
    //std::vector<int> v { 2,3,5 };
    //std::vector<int> v { 2,3,4 };
    //std::vector<int> v { 1547,83230,57084,93444,70879 };
    std::vector<int> v { 1,2,23,24,34,36 };


    //cout<<"ret:\n"<<S{}.findBestValue( v, 110 )<<endl;
    
    


    debug::log( "\n~~~~ leet: 1300 :end ~~~~\n" );
}
}//~

