/*
 * ====================== leet_133.cpp ==========================
 *                          -- tpr --
 *                                        CREATE -- 2020.08.05
 *                                        MODIFY -- 
 * ----------------------------------------------------------
 * 133. 克隆图
 */
#include "innLeet.h"
#include "GraphNode1.h"


namespace leet_133 {//~



// 未来做



class S{


public:
    // 节点值 等于 索引号
    // 参数节点，始终为 值为 1 的节点
    // 必须将 给定节点的拷贝 作为对克隆图的引用返回
    // ---
    // 节点数不超过 100
    // 每个节点值 Node.val 都是唯一的，1 <= Node.val <= 100
    // 无向图是一个简单图，这意味着图中没有重复的边，也没有自环
    // 由于图是无向的，如果节点 p 是节点 q 的邻居，那么节点 q 也必须是节点 p 的邻居
    // 图是连通图，你可以从给定节点访问到所有节点
    Node* cloneGraph( Node* node ){


        


        return nullptr;
    }
};




//=========================================================//
void main_(){

    

    debug::log( "\n~~~~ leet: 133 :end ~~~~\n" );
}
}//~
