/*
 * ====================== leet_530.cpp ==========================
 *                          -- tpr --
 *                                        CREATE -- 2020.05.28
 *                                        MODIFY -- 
 * ----------------------------------------------------------
 * 530. 二叉搜索树的最小绝对差
 * 与 783 相同 
 */
#include "innLeet.h"
#include <stack>

#include "TreeNode1.h"


namespace leet_530 {//~

// 略

//=========================================================//
void main_(){
    debug::log( "\n~~~~ leet: 530 :end ~~~~\n" );
}
}//~
